/*
  ==============================================================================

    TriggerEvent.h
    Created: 12 Oct 2025 4:58:51pm
    Author:  mt sh

  ==============================================================================
*/

#pragma once

// ===============================================
// トリガーイベント情報
// ===============================================

struct TriggerEvent
{
	bool triggerd = false;
	int sampleInBlock = -1;
	long absIndex = -1; //リングバッファ上の絶対位置
	int channel = 0; //検知チャンネル
};
